export const HEADERS = [
  "ID лида",
  "Дата обращения",
  "Имя лида",
  "Контакты",
  "Город",
  "Товар",
  "Единиц в месяц",
  "Статус",
  "Комментарий",
  "Не заполнено",
  "Менеджер",
  "Telegram менеджера",
  "Telegram ID менеджера",
  "Дата создания",
  "Дата изменения",
  "Номер КП",
  "Дата КП",
  "Ссылка на КП",
  "Сумма без НДС",
  "Сумма с НДС",
  "Статус КП",
];

export const STATUSES = [
  "Новый",
  "Требуется уточнение",
  "Связались",
  "В работе",
  "Передан в работу",
  "Отказ",
  "Отложен",
];

export const EDITABLE_FIELDS = [
  ["Дата обращения", "Дата обращения"],
  ["Имя лида", "Имя лида"],
  ["Контакты", "Контакты"],
  ["Город", "Город"],
  ["Товар", "Товар"],
  ["Единиц в месяц", "Единиц в месяц"],
  ["Комментарий", "Комментарий"],
];

export const REQUIRED_DETAILS = [
  "Имя лида",
  "Контакты",
  "Город",
  "Товар",
  "Единиц в месяц",
];
